<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"ce26b216083c80a25e531cb779c2d6bb2b462a7ba7ea2d0d62b492d0506c86a4","plan_job_ref":"Job Test plan target and replace #365 at https://github.com/dflook/terraform-github-actions/actions/runs/6645076683","plan_hash":"df5bfd83846af614fcbd0889f2e67779aa5b4aee3f0206ce2631534206b9a718","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "TCueUjojUY" -> (known after apply)
  ~ foreach = "AmWcd9vWuV" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #365](https://github.com/dflook/terraform-github-actions/actions/runs/6645076683)